You may not change the type of the group that is currently being edited.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoSwapGroupBeingEdited { get; }
  Visual Basic
Public Shared ReadOnly Property NoSwapGroupBeingEdited As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoSwapGroupBeingEdited {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace